In [6]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from  word2number import  w2n

In [7]:
df=pd.read_csv("/Users/chohan/Desktop/ML_DL_ Hackathon/Multile Linear Regression Problem(Hiring for the Job and predict the Salary)/Hiring.csv")

In [8]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [9]:
df["experience"]=df["experience"].fillna("zero")

In [10]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [11]:
df["experience"]=df["experience"].apply(w2n.word_to_num)

In [12]:
df.head()

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000

In [22]:
from math import floor
df["test_score(out of 10)"]=df["test_score(out of 10)"].replace(np.nan,floor(df["test_score(out of 10)"].mean()))

In [23]:
df["test_score(out of 10)"].isna().sum()

0

In [24]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [25]:
X=df.iloc[:,0:3].values
Y=df.iloc[:,-1].values
model=LinearRegression()
model.fit(X,Y)

LinearRegression()

In [26]:
model.intercept_

17237.3303137272

In [27]:
model.coef_

array([2827.63404314, 1912.93803053, 2196.9753141 ])

In [28]:
y=2827.63404314*4+1912.93803053*8+ 2196.9753141*7+17237.3303137272

In [29]:
y

59230.1979292272